In [1]:
t = (2,4,6,8)

t[1:3]

(4, 6)

In [2]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [3]:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

In [4]:
import pandas as pd

In [5]:
print(df.columns)
print(df.info())
print(df.describe())

Index(['calories', 'duration'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   duration  3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes
None
         calories  duration
count    3.000000       3.0
mean   396.666667      45.0
std     20.816660       5.0
min    380.000000      40.0
25%    385.000000      42.5
50%    390.000000      45.0
75%    405.000000      47.5
max    420.000000      50.0

In [6]:
print(df["calories"])

0    420
1    380
2    390
Name: calories, dtype: int64

In [7]:
print(df.loc[:, "duration"])

0    50
1    40
2    45
Name: duration, dtype: int64

In [8]:
print(df.loc[::-1])

   calories  duration
2       390        45
1       380        40
0       420        50

In [9]:
import numpy as np

ortlama_np= np.mean(df.duration)
print(ortlama_np)

45.0

In [10]:
import pandas as pd

dictionary = {"name":["batu","mete","emre","nurdan","furkan","berat"],
             "age":[24,29,33,34,None,19],
             "note":[123,456,78,87654,None,89]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age     note
0    batu  24.0    123.0
1    mete  29.0    456.0
2    emre  33.0     78.0
3  nurdan  34.0  87654.0
4  furkan   NaN      NaN
5   berat  19.0     89.0

In [11]:
print(dataframe1.note.mean()) #ortalama not hesabı

dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

17680.0

     name   age     note             ortalama
0    batu  24.0    123.0  ortalamanın altında
1    mete  29.0    456.0  ortalamanın altında
2    emre  33.0     78.0  ortalamanın altında
3  nurdan  34.0  87654.0  ortalamanın üstünde
4  furkan   NaN      NaN  ortalamanın üstünde
5   berat  19.0     89.0  ortalamanın altında

In [12]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in dataframe1.columns]
dataframe1

     name   age     note             ortalama
0    batu  24.0    123.0  ortalamanın altında
1    mete  29.0    456.0  ortalamanın altında
2    emre  33.0     78.0  ortalamanın altında
3  nurdan  34.0  87654.0  ortalamanın üstünde
4  furkan   NaN      NaN  ortalamanın üstünde
5   berat  19.0     89.0  ortalamanın altında